Repository: common-repository/sfbrowser
Catalog: wp_lang/sfbrowser-*.po
Languages: nl_nl

source: SFBrowser options
nl_nl: SFBrowser opties

source: _SFBrowser explanation
nl_nl: <p>SFBrowser is een bestandsbeheer module. Het kan gebruikt worden als alternatief op de bestaande (irritante) media bibliotheek. Daarnaast kan het gebruikt worden ter ondersteuning van plugins en/of extensies.<br/>In tegenstelling tot de bestaande media bibliotheek slaat SFBrowser niet automatisch op in de database, dat is makkelijker werken met bestanden die je via FTP upload. Daarnaast geeft het relatieve paden naar bestanden (media bibliotheek gebruikt absollute paden).</p><p>Als je vragen of ideeen hebt kat je ze op de <a href="http://wordpress.org/extend/plugins/sfbrowser/">Wordpress plugin pagina</a> posten. En vergeet niet om te <img src="../wp-content/plugins/sfbrowser/rate.png"/>.</p>

source: Save changes
nl_nl: Bewaar veranderingen

source: Basic settings
nl_nl: Basis instellingen

source: Use relative paths
nl_nl: Gebruik relatieve paden

source: Image directory
nl_nl: Afbeeldingen directory

source: (relative to upload directory)
nl_nl: (relatief tov upload directory)

source: Override Wordpress elements
nl_nl: Overschrijvingen van Wordpress elementen

source: _sfbrowser override explanation.
nl_nl: Individuele Worpress elementen die de bestaande media bibliotheek gebruiken kunnen worden overschreven om SFBrowser te gebruiken.

source: TinyMCE Upload/Insert
nl_nl: TinyMCE Uploaden/Toevoegen

source: image
nl_nl: afbeelding

source: Insertion rules
nl_nl: Invoeg regels

source: _insertion rules explanation.
nl_nl: <p>Deze regels bepalen hoe een bestand in de html wordt ingevoegd. Het eerste veld bevat een komma gescheiden lijst met bestands extensies waar de regel op toegepast moet worden. Het tweede veld is de regel voor één bestand. Het derde is een optioneel veld voor een lijst bestanden (als het leeg is wordt de regel voor één bestand gevolgd). Er zijn een aantal variabelen die je in de regel gebruiken kan:</p><ul class="nolist"><li>%file: uri naar het bestand</li><li>%mime: extensie</li><li>%rsize: grootte in bytes</li><li>%size: grootte in logisch formaat (kB, MB, GB etc...)</li><li>%time: tijd in milliseconden sinds Unix epoch</li><li>%date: opgemaakte datum/tijd</li><li>%width: breedte indien aanwezig</li><li>%height: hoogte indien aanwezig</li></ul><p>Bijvoorbeeld, de regel voor één afbeelding kan er zo uit zien: <span class="wpsfbrule">&lt;img src="%file" alt="%name" /&gt;</span>. De regel voor meerdere bestanden kan bestaan uit drie pipe-gescheiden delen: een begin, een midden (geitereerd over de lijst), en een einde. Als de regel uit twee delen bestaat is er geen eind, als de regel uit één deel bestaan wordt het als het iteratieve deel gebruikt (dus gelijk aan de één bestands regel). Een voorbeeld van een ongeordende lijst: <span class="wpsfbrule">&lt;ul&gt;|&lt;li&gt;&lt;a href="%file"&gt;%name&lt;/a&gt;&lt;/li&gt;|&lt;/ul&gt;</span>.</p>

source: SFBrowser settings
nl_nl: SFBrowser instellingen

source: _sfbrowser settings explanation.
nl_nl: SFBrowser heeft zelf een hoop instellingen. Nu zijn er maar enkele gebruikt voor Worpress. In de toekomst worden er meer toegevoegd.

source: Resize images
nl_nl: Verschaal afbeeldingen

source: _resizeExplain
nl_nl: (werkt alleen voor tinyMCE afbeelding, gebruik anders de imageresize plugin)

source: Save cookie
nl_nl: Bewaar koekje

source: _cookieExplain
nl_nl: (een koekje bewaart de afmeting en positie van SFBrowser)

source: Directory creation
nl_nl: Folders aanmaken

source: _dirsExplain
nl_nl: (geeft de mogelijkheid tot aanmaken en wijzigen van folders)

source: _swfUploadExplain
nl_nl: (gebruikt Flash voor het uploaden zodat meerdere bestanden tegelijkertijd kunnen worden upgeload)

source: Debug mode
nl_nl: Debug modus

source: _debugExplain
nl_nl: (debug modus schrijft naar log files (mits chmod goed staat), window console log en Flash traces)

source: Remove rule
nl_nl: Verwijder regel

source: Extensions
nl_nl: Extensies

source: Rule for single file
nl_nl: Regel voor één bestand

source: Rule for list of files
nl_nl: Regel voor lijst bestanden

source: Add new rule
nl_nl: Voeg nieuwe regel toe

source: Settings
nl_nl: Instellingen
